AxDen-Dev/NRF52_Ping_pong_example/main.c
}

/**@brief Function for application main entry.
 */
int main(void) {

	log_init();

	timers_init();

	gpio_init();

	twi_init();

	init_uart_2();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(data_update_state);

	conn_params_init();

	advertising_start();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	set_uart_usb_in_out_write_string("Start AxDen Ping pong example");

	get_mac_address();

	set_uart_usb_in_out_mac_address(mac_address);

	twi_scan();

	buffer_size = 0;
	memset(buffer, 0x00, sizeof(buffer));

	radio_packet_protocol.Packet.company_id[0] = COMPANY_ID >> 8;
	radio_packet_protocol.Packet.company_id[1] = COMPANY_ID;

	radio_packet_protocol.Packet.device_id[0] = DEVICE_TYPE >> 8;
	radio_packet_protocol.Packet.device_id[1] = DEVICE_TYPE;

	memcpy(radio_packet_protocol.Packet.mac_address, mac_address, 8);

	radio_packet_protocol.Packet.control_number = 0;

	NRF_LOG_INFO("Start main loop");

	for (;;) {

		if (nrf_gpio_pin_read(GPIO_BUTTON_0)) {

			nrf_gpio_pin_toggle(GPIO_LED_0);

		}

		if (nrf_gpio_pin_read(GPIO_BUTTON_1)) {

			nrf_gpio_pin_toggle(GPIO_LED_1);

		}

		if (uart_eof) {

			NRF_LOG_INFO("UART Input %s", (char* ) buffer);

			radio_packet_protocol_size = PACKET_HEADER_SIZE;
			radio_packet_protocol_size += buffer_size;

			memset(radio_packet_protocol.Packet.payload, 0x00,
					sizeof(radio_packet_protocol.Packet.payload));
			memcpy(radio_packet_protocol.Packet.payload, buffer, buffer_size);

			buffer_index = 0;
			buffer_size = 0;
			memset(buffer, 0x00, sizeof(buffer));

			uart_eof = 0x00;

			nrf_gpio_pin_toggle(GPIO_LED_2);

			if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

				adversting_stop();

				gap_params_init();

				advertising_init(data_update_state);

				advertising_start();

			}

			data_update_state = 0x01;

		}

		if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

			if (aggregator_notify_enable_state) {

				if (data_update_state) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						ble_service_send_aggregator_notification(m_conn_handle,
								&m_service, radio_packet_protocol.buffer,
								radio_packet_protocol_size);

						data_update_state = 0x00;

						NRF_LOG_INFO("Aggregator notify send");

					} else if (tx_complete_state == 0x02) {

						disconnect_timeout_count = DISCONNECT_TIMEOUT;

					}

				}

			} else if (stream_notify_enable_state) {

				if (data_update_state) {

					if (tx_complete_state) {

						tx_complete_state = 0x00;

						ble_service_send_stream_notification(m_conn_handle,
								&m_service, radio_packet_protocol.buffer,
								radio_packet_protocol_size);

						data_update_state = 0x00;

						NRF_LOG_INFO("Stream notify send");

					}

				}

				disconnect_timeout_count = 0;

			}

			disconnect_timeout_count++;

			if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

				if (request_disconnect == 0x00) {

					sd_ble_gap_disconnect(m_conn_handle,
					BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					request_disconnect = 0x01;

					NRF_LOG_INFO("Disconnect request");

				}

			}

		} else {

			disconnect_timeout_count = 0;

		}

		if (ble_input_event_state) {

			//UART Write Data
			set_uart_usb_in_out_write_string((char*) ble_input_write_buffer);
			ble_input_event_state = 0x00;

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		NRF_LOG_FLUSH();

	}

}

/**
 * @}
 */
